CSI API ETABS v1

# cAreaObjSetLoadUniformToFrame Method

---

NOT APPLICABLE - Assigns uniform to frame load to area objects.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetLoadUniformToFrame(
    	string Name,
    	string LoadPat,
    	double Value,
    	int Dir,
    	int DistType,
    	bool Replace = true,
    	string CSys = "Global",
    	eItemType ItemType = eItemType.Objects
    )

    Function SetLoadUniformToFrame (
    	Name As String,
    	LoadPat As String,
    	Value As Double,
    	Dir As Integer,
    	DistType As Integer,
    	Optional Replace As Boolean = true,
    	Optional CSys As String = "Global",
    	Optional ItemType As eItemType = eItemType.Objects
    ) As Integer

    Dim instance As cAreaObj
    Dim Name As String
    Dim LoadPat As String
    Dim Value As Double
    Dim Dir As Integer
    Dim DistType As Integer
    Dim Replace As Boolean
    Dim CSys As String
    Dim ItemType As eItemType
    Dim returnValue As Integer

    returnValue = instance.SetLoadUniformToFrame(Name,
    	LoadPat, Value, Dir, DistType, Replace,
    	CSys, ItemType)

    int SetLoadUniformToFrame(
    	String^ Name,
    	String^ LoadPat,
    	double Value,
    	int Dir,
    	int DistType,
    	bool Replace = true,
    	String^ CSys = L"Global",
    	eItemType ItemType = eItemType::Objects
    )

    abstract SetLoadUniformToFrame :
            Name : string *
            LoadPat : string *
            Value : float *
            Dir : int *
            DistType : int *
            ?Replace : bool *
            ?CSys : string *
            ?ItemType : eItemType
    (* Defaults:
            let _Replace = defaultArg Replace true
            let _CSys = defaultArg CSys "Global"
            let _ItemType = defaultArg ItemType eItemType.Objects
    *)
    -> int

#### Parameters

Name

    Type: SystemString
The name of an existing area object or group, depending on the value of the
ItemType item.

LoadPat

    Type: SystemString
The name of a defined load pattern.

Value

    Type: SystemDouble
The uniform load value. [F/L2]

Dir

    Type: SystemInt32
This is an integer between 1 and 11, indicating the direction of the load.

  1. Local 1 axis (only applies when CSys is Local)
  2. Local 2 axis (only applies when CSys is Local)
  3. Local 3 axis (only applies when CSys is Local)
  4. X direction (does not apply when CSys is Local)
  5. Y direction (does not apply when CSys is Local)
  6. Z direction (does not apply when CSys is Local)
  7. Projected X direction (does not apply when CSys is Local)
  8. Projected Y direction (does not apply when CSys is Local)
  9. Projected Z direction (does not apply when CSys is Local)
  10. Gravity direction (only applies when CSys is Global)
  11. Projected Gravity direction (only applies when CSys is Global)

The positive gravity direction (see Dir = 10 and 11) is in the negative Global
Z direction.

DistType

    Type: SystemInt32
This is either 1 or 2, indicating the load distribution type.

  1. One-way load distribution
  2. Two-way load distribution

Replace (Optional)

    Type: SystemBoolean
If this item is True, all previous uniform loads, if any, assigned to the
specified area object(s), in the specified load pattern, are deleted before
making the new assignment.

CSys (Optional)

    Type: SystemString
This is Local or the name of a defined coordinate system, indicating the
coordinate system in which the uniform load is specified.

ItemType (Optional)

    Type: ETABSv1eItemType
This is one of the following items in the
eItemType enumeration:

  * Object = 0
  * Group = 1
  * SelectedObjects = 2

If this item is Objects, the
assignment is made to the area object specified by the Name item.

If this item is Group, the
assignment is made to all area objects in the group specified by the Name
item.

If this item is SelectedObjects,
assignment is made to all selected area objects, and the Name item is ignored.

#### Return Value

Type: Int32
Returns zero if the loads are successfully assigned; otherwise it returns a
nonzero value.

Remarks

Examples

VB

Copy

    Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1

    'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

    'start ETABS application
      ret = EtabsObject.ApplicationStart()

    'create SapModel object
       SapModel = EtabsObject.SapModel

    'initialize model
       ret = SapModel.InitializeNewModel()

    'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

    'assign area object uniform loads
      ret = SapModel.AreaObj.SetLoadUniformToFrame("2", "Dead", 0.00581, 6, 1)

    'refresh view
       ret = SapModel.View.RefreshView(0, False)

    'close ETABS
       EtabsObject.ApplicationExit(False)

    'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing

    End Sub

See Also

#### Reference

cAreaObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com